Data/Final_Implemented_data/Request/Request random/Text Files/test_rand3.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        706 bytes

Concurrency Level:      10
Time taken for tests:   3.350 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      86158 bytes
HTML transferred:       70658 bytes
Requests per second:    29.85 [#/sec] (mean)
Time per request:       335.014 [ms] (mean)
Time per request:       33.501 [ms] (mean, across all concurrent requests)
Transfer rate:          25.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       30  259  54.1    268     376
Processing:     1   47  73.0      4     249
Waiting:        1   44  68.6      3     234
Total:         46  306  96.7    289     541

Percentage of the requests served within a certain time (ms)
  50%    289
  66%    320
  75%    350
  80%    376
  90%    473
  95%    521
  98%    537
  99%    541
 100%    541 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        938 bytes

Concurrency Level:      10
Time taken for tests:   6.096 seconds
Complete requests:      200
Failed requests:        16
   (Connect: 0, Receive: 0, Length: 16, Exceptions: 0)
Total transferred:      219941 bytes
HTML transferred:       188934 bytes
Requests per second:    32.81 [#/sec] (mean)
Time per request:       304.823 [ms] (mean)
Time per request:       30.482 [ms] (mean, across all concurrent requests)
Transfer rate:          35.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       26  243  71.6    246     445
Processing:     1   53  73.7      3     268
Waiting:        1   48  67.1      3     264
Total:         43  296 107.3    290     576

Percentage of the requests served within a certain time (ms)
  50%    290
  66%    324
  75%    364
  80%    387
  90%    441
  95%    486
  98%    550
  99%    558
 100%    576 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        706 bytes

Concurrency Level:      10
Time taken for tests:   10.351 seconds
Complete requests:      300
Failed requests:        13
   (Connect: 0, Receive: 0, Length: 13, Exceptions: 0)
Total transferred:      259054 bytes
HTML transferred:       212554 bytes
Requests per second:    28.98 [#/sec] (mean)
Time per request:       345.021 [ms] (mean)
Time per request:       34.502 [ms] (mean, across all concurrent requests)
Transfer rate:          24.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       67  277  48.6    274     387
Processing:     1   60  77.2      4     227
Waiting:        1   56  72.1      4     226
Total:        101  337  96.5    306     555

Percentage of the requests served within a certain time (ms)
  50%    306
  66%    367
  75%    409
  80%    443
  90%    490
  95%    519
  98%    535
  99%    544
 100%    555 (longest request)